INSERT INTO review (id,score, content, created_at, trainer_id, user_id)
VALUES
    (1,5, '최고의 트레이너입니다!', 1710806400, 1, 1),
    (2,4, '수업이 친절하고 좋았어요.', 1710892800, 2, 2),
    (3,3, '보통이었어요.', 1710979200, 1, 3),
    (4,5, '정말 만족합니다!', 1711065600, 3, 4),
    (5,2, '별로였어요.', 1711152000, 2, 5),
    (6,4, '운동 프로그램이 체계적이에요.', 1711238400, 1, 6),
    (7,5, '재등록 의사 있습니다!', 1711324800, 3, 7),
    (8,3, '괜찮았어요.', 1711411200, 2, 8),
    (9,1, '개선이 필요할 것 같아요.', 1711497600, 1, 9),
    (10,4, '친절하고 설명이 자세해요.', 1711584000, 3, 10);