INSERT INTO answer (id, content, like_count, created_at, modified_at, post_id, trainer_id)
VALUES (1, '첫 번째 답변입니다.', 0, 1700000000, 0, 1, 1),
       (2, '두 번째 답변입니다.', 0, 1700000500, 0, 1, 2),
       (3, '세 번째 답변입니다.', 0, 1700001000, 0, 2, 3),
       (4, '네 번째 답변입니다.', 0, 1700001500, 0, 2, 1),
       (5, '다섯 번째 답변입니다.', 0, 1700002000, 0, 3, 2);


INSERT INTO answer (id, content, like_count, created_at, modified_at, post_id, trainer_id)
VALUES (6, '여섯 번째 답변입니다.', 0, 1700002500, 0, 3, 1),
       (7, '일곱 번째 답변입니다.', 0, 1700003000, 0, 4, 1),
       (8, '여덟 번째 답변입니다.', 0, 1700003500, 0, 4, 1),
       (9, '아홉 번째 답변입니다.', 0, 1700004000, 0, 5, 1),
       (10, '열 번째 답변입니다.', 0, 1700004500, 0, 5, 1),
       (11, '열한 번째 답변입니다.', 0, 1700005000, 0, 6, 1),
       (12, '열두 번째 답변입니다.', 0, 1700005500, 0, 6, 1),
       (13, '열세 번째 답변입니다.', 0, 1700006000, 0, 7, 1),
       (14, '열네 번째 답변입니다.', 0, 1700006500, 0, 7, 1),
       (15, '열다섯 번째 답변입니다.', 0, 1700007000, 0, 8, 1),
       (16, '열여섯 번째 답변입니다.', 0, 1700007500, 0, 8, 1),
       (17, '열일곱 번째 답변입니다.', 0, 1700008000, 0, 9, 1),
       (18, '열여덟 번째 답변입니다.', 0, 1700008500, 0, 9, 1),
       (19, '열아홉 번째 답변입니다.', 0, 1700009000, 0, 10, 1),
       (20, '스무 번째 답변입니다.', 0, 1700009500, 0, 10, 1);